; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared5 - mode
	spectrograph0 - mode
	infrared1 - mode
	spectrograph4 - mode
	infrared2 - mode
	spectrograph3 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
)
(:goal (and
	(pointing satellite3 Planet6)
	(have_image Phenomenon5 infrared1)
	(have_image Phenomenon5 infrared5)
	(have_image Planet6 spectrograph4)
	(have_image Planet6 infrared2)
	(have_image Star7 infrared2)
	(have_image Planet8 spectrograph0)
	(have_image Planet8 spectrograph4)
	(have_image Star9 spectrograph4)
	(have_image Star9 spectrograph3)
	(have_image Planet10 spectrograph3)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 spectrograph4)
	(have_image Planet11 infrared2)
	(have_image Phenomenon12 spectrograph4)
	(have_image Phenomenon12 infrared5)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 infrared1)
	(have_image Planet14 spectrograph0)
))

)

; plan
1. (turn_to satellite2 groundstation2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 19
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 19
3. (calibrate satellite2 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 19
4. (turn_to satellite2 planet10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet10)
   goals met: 0 of 19
5. (take_image satellite2 planet10 instrument2 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 1 of 19
6. (turn_to satellite2 phenomenon12 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon12)
   goals met: 1 of 19
7. (turn_to satellite1 groundstation2 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 19
8. (turn_to satellite0 groundstation4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 19
9. (take_image satellite2 phenomenon12 instrument2 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 2 of 19
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 19
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 19
12. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 19
13. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 19
14. (turn_to satellite0 phenomenon12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 19
15. (take_image satellite0 phenomenon12 instrument0 infrared5)
   added: (have_image phenomenon12 infrared5)
   goals met: 3 of 19
16. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 19
17. (take_image satellite0 phenomenon13 instrument0 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 4 of 19
18. (turn_to satellite0 phenomenon5 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 19
19. (take_image satellite0 phenomenon5 instrument0 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 5 of 19
20. (take_image satellite0 phenomenon5 instrument0 infrared5)
   added: (have_image phenomenon5 infrared5)
   goals met: 6 of 19
21. (turn_to satellite0 planet10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet10)
   goals met: 6 of 19
22. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 7 of 19
23. (turn_to satellite0 planet14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet14)
   goals met: 7 of 19
24. (take_image satellite0 planet14 instrument0 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 8 of 19
25. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 9 of 19
26. (turn_to satellite0 planet8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet8)
   goals met: 9 of 19
27. (take_image satellite0 planet8 instrument0 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 10 of 19
28. (turn_to satellite1 planet11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet11)
   goals met: 10 of 19
29. (take_image satellite1 planet11 instrument1 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 11 of 19
30. (turn_to satellite1 planet6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet6)
   goals met: 11 of 19
31. (take_image satellite1 planet6 instrument1 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 12 of 19
32. (turn_to satellite1 star7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star7)
   goals met: 12 of 19
33. (take_image satellite1 star7 instrument1 infrared2)
   added: (have_image star7 infrared2)
   goals met: 13 of 19
34. (turn_to satellite2 planet11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet11)
   goals met: 13 of 19
35. (take_image satellite2 planet11 instrument2 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 14 of 19
36. (turn_to satellite2 planet6 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet6)
   goals met: 14 of 19
37. (take_image satellite2 planet6 instrument2 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 15 of 19
38. (turn_to satellite2 planet8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet8)
   goals met: 15 of 19
39. (take_image satellite2 planet8 instrument2 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 16 of 19
40. (turn_to satellite2 star9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star9)
   goals met: 16 of 19
41. (take_image satellite2 star9 instrument2 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 17 of 19
42. (take_image satellite2 star9 instrument2 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 18 of 19
43. (turn_to satellite3 planet6 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet6)
   goals met: 19 of 19
